Revit 2027 API
ReferenceArray.Append Method
Add the reference to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Reference item
)
Public Overridable Sub Append (
	item As Reference
)
public:
virtual void Append(
	Reference^ item
)
abstract Append :
        item : Reference -> unit
override Append :
        item : Reference -> unit
Parameters
item Reference
The reference to be added.
See Also
Reference
ReferenceArray Class
Autodesk.Revit.DB Namespace